{
  "videos": [
    {
      "id": 1,
      "name": "Джек Ричер",
      "originalName": "Jack Reacher",
      "director": "Кристофер МакКуорри",
      "country": [
        "США"
      ],
      "genre": [
        "боевик",
        "триллер",
        "детектив",
        "криминал"
      ],
      "picture": "http://onvix.tv/uploads/posters/9f/fb/29e895a4952990bec5b4647187eb/medium_d50b99ef2a99d69bac3b03ef.jpg",
      "year": 2012,
      "rating": 7,
      "description": "Снайпер убивает нескольких случайных прохожих. Его находят и арестовывают. Все улики указывают на него. На допросе вместо признания он пишет имя - Джек Ричер. Больше обвиняемый не может ничего сказать, поскольку после избиения заключёнными впадает в кому. Загадочный Джек Ричер появляется незамедлительно. Что теперь будет с убийцей?"
    },
    {
      "id": 2,
      "name": "Пол: Секретный материальчик",
      "originalName": "Paul",
      "director": "Грег Моттола",
      "country": [
        "США",
        "Великобритания"
      ],
      "genre": [
        "фантастика",
        "комедия",
        "приключения"
      ],
      "picture": "http://onvix.tv/uploads/posters/f5/3a/84f48dd39c882d016ca2ddf09228/medium_789e1e1dabfadb9141557d44.jpg",
      "year": 2011,
      "rating": 7.2,
      "description": "Два английских гика отправляются на одно из самых значимых фанатских событий в области фантастики - конвент ComicCon в Америке. По пути, неподалёку от известной Зоны 51, они встречают сбежавшего инопланетянина по имени Пол, который просит помочь ему добраться домой. Пытаясь спастись от правительственных агентов, герои случайно похищают женщину и натыкаются на обкуренную свидетельницу аварийной посадки Пола на Землю."
    },
    {
      "id": 3,
      "name": "Неадекватные люди",
      "originalName": "",
      "director": "Роман Каримов",
      "country": [
        "Россия"
      ],
      "genre": [
        "драма",
        "мелодрама",
        "комедия"
      ],
      "picture": "http://onvix.tv/uploads/posters/1e/35/25dcafaa4435098f8c0b96ecdd6f/medium_21790f1c04edf327bdbea632.jpg",
      "year": 2010,
      "rating": 7.6,
      "description": "Тридцатилетний молодой человек Виталий, убегая от надоедливых проблем и душевного дискомфорта, бросает провинциальный городок Серпухов и переезжает в Москву, надеясь именно здесь найти гармонию с собственным «я». Но до состояния гармонии ему оказывается слишком далеко, ведь впоследствии возникает очень много вопросов, связанных с его новой соседкой Кристиной, которой также не очень везет в жизни и которая пытается «сделать» из него действительно крутого мэна, а также с начальницей, желающей затащить его в кровать. С каждым днем он все больше убеждается в неадекватности подобных людей, которые буквально сорвались с цепи. Но что, если проблема не только в них?"
    },
    {
      "id": 4,
      "name": "Джон Картер",
      "originalName": "John Carter",
      "director": "Эндрю Стэнтон",
      "country": [
        "США"
      ],
      "genre": [
        "фантастика",
        "боевик",
        "приключения"
      ],
      "picture": "http://onvix.tv/uploads/posters/e0/83/b180be5893e8f978282259072e05/medium_33c5746a9eba96e6958de7ab.jpg",
      "year": 2012,
      "rating": 6.9,
      "description": "Ветеран Гражданской войны в США Джон Картер против своей воли оказывается на Марсе, где попадает в плен к воинственным четырехметровым туземцам. Картеру предстоит не только спастись самому, но и спасти принцессу Дею Торис из Гелиума."
    },
    {
      "id": 5,
      "name": "Хорошо быть тихоней",
      "originalName": "The Perks of Being a Wallflower",
      "director": "Стивен Чбоски",
      "country": [
        "США"
      ],
      "genre": [
        "драма",
        "мелодрама"
      ],
      "picture": "http://onvix.tv/uploads/posters/de/31/559567106ade010a248ebb9ea309/medium_93f727ac36492715ebc65161.jpg",
      "year": 2012,
      "rating": 8,
      "description": "История о Чарли, ученике старшей школы в Питтсбурге, стеснительном и непопулярном. На наших глазах Чарли взрослеет, меняется круг его общения, меняется его мнение о мире."
    },
    {
      "id": 6,
      "name": "Няня",
      "originalName": "The Babysitter",
      "director": "МакДжи",
      "country": [
        "США"
      ],
      "genre": [
        "комедия",
        "триллер"
      ],
      "picture": "http://onvix.tv/uploads/posters/b7/ec/d1944688d347b7646ce2fac898e3/medium_743da2bca0efca696150b9a9.jpg",
      "year": 2012,
      "rating": 6.6,
      "description": "Коул по уши влюблён в свою няню Би, красивую, весёлую и популярную девушку. Однажды ночью мальчишка решает не ложиться спать и проследить за ней. Но события принимают неожиданный поворот: няня оказывается хладнокровной убийцей, служащей самому дьяволу."
    },
    {
      "id": 7,
      "name": "Рик и Морти",
      "originalName": "Rick and Morty",
      "director": "Пит Мишелс, Уэсли Арчер, Брайан Ньютон",
      "country": [
        "США"
      ],
      "genre": [
        "мультфильм",
        "комедия",
        "фантастика"
      ],
      "picture": "http://onvix.tv/uploads/posters/a5/90/d5a60524f931f1c4489d570804a6/medium_1edef15be8c0df31a9a8e5b2.jpg",
      "year": 2013,
      "rating": 9.4,
      "description": "В центре сюжета - школьник по имени Морти и его дедушка Рик. Морти - самый обычный мальчик, который ничем не отличается от своих сверстников. А вот его дедуля занимается необычными научными исследованиями и зачастую полностью неадекватен. Он может в любое время дня и ночи схватить внука и отправиться вместе с ним в межпространственные приключения с помощью построенной из разного хлама летающей тарелки, которая способна перемещаться сквозь временной тоннель. Каждый раз эта парочка оказывается в самых неожиданных местах и самых нелепых ситуациях."
    },
    {
      "id": 8,
      "name": "Грань будущего",
      "originalName": "Edge of Tomorrow",
      "director": "Даг Лайман",
      "country": [
        "США",
        "Канада"
      ],
      "genre": [
        "фантастика",
        "боевик",
        "приключения"
      ],
      "picture": "http://onvix.tv/uploads/posters/f8/57/c77c6d525bdb9a11123be7142b46/medium_87236bbc83fc6652bf11a5c4.jpg",
      "year": 2014,
      "rating": 7.9,
      "description": "В недалёком будущем раса инопланетян вторгается на Землю. Никакая армия в мире не может противостоять им. Майор Уильям Кейдж умирает в бою, но случается невозможное - он оказывается во временной петле. Раз за разом он попадает в один и тот же бой, сражается и умирает... снова и снова. И каждое повторяющееся сражение приближает его к разгадке того, как победить врага."
    },
    {
      "id": 9,
      "name": "Стеклянный замок",
      "originalName": "The Glass Castle",
      "director": "Дестин Креттон",
      "country": [
        "США"
      ],
      "genre": [
        "драма",
        "биография"
      ],
      "picture": "http://onvix.tv/uploads/posters/44/1b/c0e60748bc17654cbd0e55ecd384/large_dde9bdcab09c38c6d557644d.jpg",
      "year": 2017,
      "rating": 7.1,
      "description": "Девочка растет в неблагополучной семье нонконформистов-кочевников. Ее мать эксцентричная артистка, а отец - алкоголик. Родители пытаются вселить надежду в ее детское воображение, чтобы хоть как-то отвлечь внимание от бедности."
    },
    {
      "id": 10,
      "name": "Планета обезьян: Война",
      "originalName": "War for the Planet of the Apes",
      "director": "Мэтт Ривз",
      "country": [
        "США",
        "Канада",
        "Новая Зеландия"
      ],
      "genre": [
        "фантастика",
        "боевик",
        "триллер",
        "драма",
        "приключения"
      ],
      "picture": "http://onvix.tv/uploads/posters/eb/9a/6498e4437ef5a62f3097777d3e1d/large_e556053889b88b302a343a3f.jpg",
      "year": 2017,
      "rating": 7.6,
      "description": "Армию генетически модифицированных обезьян ожидает новый вызов: они вынуждены вступить в смертельную схватку с армией людей под руководством безжалостного полковника. После невообразимых потерь среди своих воинов вождь обезьян Цезарь начинает личную борьбу с темными инстинктами и собирается отомстить за весь свой вид. В конце концов он и полковник должны будут сойтись в эпической битве, которая решит, кто теперь будет править на Земле - люди или обезьяны."
    },
    {
      "id": 11,
      "name": "Тёмная башня",
      "originalName": "The Dark Tower",
      "director": "Николай Арсель",
      "country": [
        "США"
      ],
      "genre": [
        "ужасы",
        "фантастика",
        "фэнтези",
        "боевик",
        "приключения",
        "вестерн"
      ],
      "picture": "http://onvix.tv/uploads/posters/23/91/1e4b8df49ac8c465979be033eaaf/large_344fd0170c8e4781b700fe4d.jpg",
      "year": 2017,
      "rating": 5.8,
      "description": "Наш мир - не единственный из существующих. Заклятые враги Роланд Дискейн, последний из ордена стрелков, и Уолтер О’Дим, известный также как Человек в черном, ведут извечную борьбу. На кону - мифическая Темная Башня, последний оплот и надежда вселенной, без которой мир будет повержен в полный хаос и разрушение. Силам добра и зла суждено столкнуться в последней схватке, ведь Роланд Дискейн - единственный, кому под силу остановить Человека в черном, прежде чем тот разрушит Темную Башню."
    },
    {
      "id": 12,
      "name": "Секс-Трип",
      "originalName": "The Sex Trip",
      "director": "Энтони Дж. Коэн",
      "country": [
        "США"
      ],
      "genre": [
        "фэнтези",
        "комедия"
      ],
      "picture": "http://onvix.tv/uploads/posters/d1/c2/7fe325fea28fe5c367910786e363/large_6a72cec3036a92facabd7387.jpg",
      "year": 2017,
      "rating": 8.1,
      "description": "Всего себя красавчик Эдди Гринлиф посвятил искусству соблазнения женщин. Эдди ведёт тренинги, пишет книги, раздаёт интервью и каждый божий день применяет свои теории на практике, укладывая в свою постель самых привлекательных представительниц прекрасного пола. Однако такая озабоченная-беззаботная жизнь просто не могла длиться вечно и сама судьба в виде уродливой ведьмы наказала Эдди. Как-то раз, направляясь на вечерику, Эдди повстречал старуху, которая потребовала его поцелуй. «Бабуля, тебе со мной не светит» - отшутился Эдди и отправился на очередные подвиги. Однако утром он к своему тотальному удивлению обнаружил, что превратился в привлекательную брюнетку Эдну! Что же делать? Как вернуть свое тело?"
    },
    {
      "id": 13,
      "name": "Мистер Штайн идёт в онлайн",
      "originalName": "Un profil pour deux",
      "director": "Стефан Робели",
      "country": [
        "Франция",
        "Германия",
        "Бельгия"
      ],
      "genre": [
        "комедия"
      ],
      "picture": "http://onvix.tv/uploads/posters/4a/35/a1d2c0002848151c27b8f59b7565/large_748594eae0798eed9c820bce.jpg",
      "year": 2017,
      "rating": 6.5,
      "description": "75-летний вдовец ведёт уединённый образ жизни. Родственники дарят ему компьютер в надежде оживить будни старика. Вскоре он заводит онлайн знакомство, правда, несколько приукрасив данные своего профайла. Элегантной беседой, несвойственной современным людям, он сильно заинтересовывает молодую красивую женщину. Как избежать разоблачения при личной встрече?"
    },
    {
      "id": 14,
      "name": "Гоголь. Начало",
      "originalName": "",
      "director": "Егор Баранов",
      "country": [
        "Россия"
      ],
      "genre": [
        "приключения",
        "триллер",
        "детектив"
      ],
      "picture": "http://onvix.tv/uploads/posters/47/8e/e5c7ee09489340ec7c8711e3a998/large_f184a379c586c4793f3e4a06.jpg",
      "year": 2017,
      "rating": 6.1,
      "description": "Казаки, ведьмы, русалки, утопленницы и другие обитатели Диканьки встречаются лицом к лицу со своим создателем Николаем Гоголем, молодым писарем из Петербурга, который страдает загадочными припадками и может общаться с персонажами из потустороннего мира. Вместе со своим начальником, блестящим столичным следователем Яковым Гуро, начинающий писатель приезжает на Полтавщину расследовать таинственные убийства девушек. Здесь же он встречает свою любовь, которой суждено сыграть роковую роль в его судьбе. Но хватит ли юному литератору духу противостоять невообразимому? Ведь по слухам, которые активно разносят напуганные местные жители, за преступлениями стоит не кто иной, как сам Дьявол в обличии черного всадника."
    },
    {
      "id": 15,
      "name": "Охотник с Уолл-стрит",
      "originalName": "The Glass Castle",
      "director": "Дестин Креттон",
      "country": [
        "США"
      ],
      "genre": [
        "драма",
        "биография"
      ],
      "picture": "http://onvix.tv/uploads/posters/11/6b/1ca7f215622dd92bfab1fc227e42/medium_2b07bf2bfe5e9a26bac71fc7.jpg",
      "year": 2016,
      "rating": 7.1,
      "description": "Циничный и обаятельный хедхантер с Уолл-стрит Дэйн Дженсен близок к осуществлению своей американской мечты и покорению бизнес-олимпа. Но его карьерные интересы внезапно входят в противоречие с жизнью его семьи. Перед Дэйном встает непростой вопрос выбора."
    },
    {
      "id": 16,
      "name": "Мяу",
      "originalName": "Miao xing ren",
      "director": "Бенни Чан",
      "country": [
        "Гонконг"
      ],
      "genre": [
        "фантастика",
        "комедия"
      ],
      "picture": "http://onvix.tv/uploads/posters/9d/6e/6f871ff67989dd79a530ebf103c3/large_ed17cf434efbfb26ced16de5.jpg",
      "year": 2017,
      "rating": 5,
      "description": "На Землю прилетает кот-инопланетянин."
    },
    {
      "picture": "//onvix.tv/uploads/posters/27/ee/a13cd02f92f7592d00d8fe8f1739/large_88a0933307e78690b63cba62.jpg",
      "name": "Валериан и город тысячи планет",
      "originalName": "Valerian and the City of a Thousand Planets",
      "director": "Люк Бессон",
      "country": [
        "Франция",
        "Китай",
        "Бельгия",
        "ОАЭ",
        "США",
        "Германия",
        "Великобритания",
        "Канада"
      ],
      "genre": [
        "фантастика",
        "фэнтези",
        "боевик",
        "приключения"
      ],
      "year": "2017",
      "rating": "6.7",
      "description": "2700 год. Валериан и Лорелин - космические спецагенты, которые по долгу службы впутались в подозрительное дело и стали невольными участниками то ли межгалактического заговора, то ли аферы причудливых поселенцев планеты Альфа, прибывших туда из различных миров со всех уголков галактик.",
      "id": 17
    },
    {
      "name": "Сингулярность",
      "originalName": "Singularity",
      "picture": "http://onvix.tv/uploads/posters/d3/ac/119a6c33f72d5beed809bca80a7c/large_f6455db418d9b9ed389e1690.jpg",
      "director": "Роберт Коуба",
      "country": [
        "Швейцария",
        "США"
      ],
      "genre": [
        "фантастика"
      ],
      "year": "2017",
      "rating": "-",
      "id": 18
    }
  ]
}